ФБКРозница/src/Catalogs/КлассификаторАлкогольнойПродукцииЕГАИС/КлассификаторАлкогольнойПродукцииЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторАлкогольнойПродукцииЕГАИС</name>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>DefinedType.ВидАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНоменклатура</name>
    <type>
      <types>DefinedType.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХарактеристика</name>
    <type>
      <types>DefinedType.ХарактеристикаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСопоставлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродукции</name>
    <type>
      <types>EnumRef.ТипыПродукцииЕГАИС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьУпаковки</name>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ФБКРозница/src/InformationRegisters/СоответствиеНоменклатурыЕГАИС/СоответствиеНоменклатурыЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствиеНоменклатурыЕГАИС</name>
  <resources>
    <name>АлкогольнаяПродукция</name>
    <type>
      <types>CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</types>
    </type>
  </resources>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.ХарактеристикаНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ФБКРозница/src/Enums/ВидыДокументовЕГАИС/ВидыДокументовЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДокументовЕГАИС</name>
  <enumValues>
    <name>АктТТН</name>
  </enumValues>
  <enumValues>
    <name>АктТТНОтказ</name>
  </enumValues>
  <enumValues>
    <name>АктТТНПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр1</name>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр2</name>
  </enumValues>
  <enumValues>
    <name>АктТТНРасхождения</name>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра1</name>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра2</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзРегистра2</name>
  </enumValues>
  <enumValues>
    <name>ЗапросАлкогольнойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияАктаПостановкиНаБаланс</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияАктаСписания</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияТТН</name>
  </enumValues>
  <enumValues>
    <name>ЗапросДанныхОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковВРегистре1</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковВРегистре2</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки1</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки2</name>
  </enumValues>
  <enumValues>
    <name>ЗапросТТН</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОФорматеОбмена</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияПроведенЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияПолученЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>ЗапросАкцизныхМарок</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросАкцизныхМарок</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросАлкогольнойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросДанныхОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОстатковВРегистре1</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияЗапросаНаОтменуПроведенияТТН</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОстатковВРегистре2</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхожденийОтказ</name>
  </enumValues>
  <enumValues>
    <name>Квитанция</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияЗапросаНаОтменуПроведенияТТНОтказ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВРегистр2</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхождений</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхожденийПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияЗапросаНаОтменуПроведенияТТНПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОРегистрацииДвиженияТТН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОРегистрацииДвиженияАктаПостановкиНаБаланс</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаДвиженияМеждуРегистрами</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаДвиженияПоСправке2</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаИнформацияОбОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаНеобработанныеТТН</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОбработанныеЧеки</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре1</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре2</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаДвиженияМеждуРегистрами</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаДвиженияПоСправке2</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаИнформацияОбОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаНеобработанныеТТН</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОбработанныеЧеки</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре1</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре2</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросСправки1</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросСправки2</name>
  </enumValues>
  <enumValues>
    <name>ТТН</name>
  </enumValues>
  <enumValues>
    <name>ЧекККМ</name>
  </enumValues>
</mdclass:Enum>

ФБКРозница/src/Catalogs/КлассификаторАлкогольнойПродукцииЕГАИС/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИСПереопределяемый.НастроитьПодключаемоеОборудование(ЭтотОбъект);
	
	Поля = Новый Массив;
	Поля.Добавить("Сопоставлено");
	
	Список.УстановитьОграниченияИспользованияВГруппировке(Поля);
	Список.УстановитьОграниченияИспользованияВОтборе(Поля);
	Список.УстановитьОграниченияИспользованияВПорядке(Поля);
	
	СобытияФормЕГАИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПоддерживаемыеТипыПодключаемогоОборудования = "СканерШтрихкода";
	
	ОповещениеПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(
		ОповещениеПриПодключении,
		ЭтотОбъект,
		ПоддерживаемыеТипыПодключаемогоОборудования);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОповещениеПриОтключении = Новый ОписаниеОповещения("ОтключитьОборудованиеЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(ОповещениеПриОтключении, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	СобытияФормЕГАИСКлиентПереопределяемый.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
	Если ИмяСобытия = "ИзменениеСопоставленияАлкогольнойПродукцииЕГАИС" Тогда
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	ОповещенияПриЗавершении = СобытияФормЕГАИСКлиент.СтруктураОповещенийВнешнегоСобытия(ЭтотОбъект, Истина, Истина);
	
	СобытияФормЕГАИСКлиент.ВнешнееСобытиеПолученыШтрихкоды(ОповещенияПриЗавершении, ЭтотОбъект, Источник, Событие, Данные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.Сопоставлено Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		
		ИнтеграцияЕГАИСКлиент.ОткрытьФормуСопоставленияАлкогольнойПродукции(
			ТекущиеДанные.Ссылка,
			ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	|ГДЕ
	|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция В(&АлкогольнаяПродукция)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабличнаяЧасть.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ СопоставленоПозиций
	|ИЗ
	|	Товары КАК ТабличнаяЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	|		ПО (СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция = ТабличнаяЧасть.АлкогольнаяПродукция)
	|ГДЕ
	|	НЕ СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабличнаяЧасть.АлкогольнаяПродукция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Ссылка                                     КАК Ссылка,
	|	ЕСТЬNULL(СопоставленоПозиций.Количество, 0)  КАК Количество,
	|	СоответствиеНоменклатурыЕГАИС.Номенклатура   КАК Номенклатура,
	|	СоответствиеНоменклатурыЕГАИС.Характеристика КАК Характеристика
	|ИЗ
	|	Справочник.КлассификаторАлкогольнойПродукцииЕГАИС КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ СопоставленоПозиций КАК СопоставленоПозиций
	|		ПО (СопоставленоПозиций.АлкогольнаяПродукция = Т.Ссылка)
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Товары КАК Товары
	|		ПО (Товары.АлкогольнаяПродукция = Т.Ссылка)
	|		И СопоставленоПозиций.Количество = 1
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	|		ПО (Т.Ссылка = СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция)
	|		И СопоставленоПозиций.Количество = 1
	|	
	|ГДЕ
	|	Т.Ссылка В(&АлкогольнаяПродукция)");
	Запрос.УстановитьПараметр("АлкогольнаяПродукция", Строки.ПолучитьКлючи());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаСписка = Строки[Выборка.Ссылка];
		
		Если Выборка.Количество = 1 Тогда
			СтрокаСписка.Данные["Сопоставлено"] = ИнтеграцияЕГАИСПереопределяемый.ПредставлениеНоменклатуры(
				Выборка.Номенклатура,
				Выборка.Характеристика, Неопределено);
			СтрокаСписка.Оформление["Сопоставлено"].УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветГиперссылкиГИСМ);
		ИначеЕсли Выборка.Количество > 1 Тогда
			СтрокаСписка.Данные["Сопоставлено"] = СтрШаблон(НСтр("ru = '<Несколько позиций (%1)>'"), Выборка.Количество);
			СтрокаСписка.Оформление["Сопоставлено"].УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветГиперссылкиГИСМ);
		Иначе
			СтрокаСписка.Данные["Сопоставлено"] = НСтр("ru = '<Не сопоставлено>'");
			СтрокаСписка.Оформление["Сопоставлено"].УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЕГАИССтатусОбработкиОшибкаПередачи);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоискПоШтрихкодуВыполнить(Команда)
	
	ОчиститьСообщения();
	
	ШтрихкодированиеНоменклатурыЕГАИСКлиентПереопределяемый.ПоказатьВводШтрихкода(
		Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормЕГАИСКлиентПереопределяемый.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(ДанныеШтрихкода, ДополнительныеПараметры) Экспорт
	
	ОповещенияПриЗавершении = СобытияФормЕГАИСКлиент.СтруктураОповещенийВнешнегоСобытия(ЭтотОбъект, Истина, Истина);
	
	АкцизныеМаркиЕГАИСКлиент.ОбработатьДанныеШтрихкода(ОповещенияПриЗавершении, ЭтотОбъект, ДанныеШтрихкода);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолученыШтрихкоды(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Количество() = 1 Тогда
		РезультатПоиска = ПолучитьДанныеПоШтрихкоду(Результат[0].Штрихкод);
		Если РезультатПоиска <> Неопределено Тогда
			Элементы.Список.ТекущаяСтрока = РезультатПоиска.НоменклатураЕГАИС;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон(
					НСтр("ru = 'По штрихкоду %1 не удалось найти алкогольную продукцию'"),
					Результат[0].Штрихкод));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолученаАкцизнаяМарка(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат.АлкогольнаяПродукция)
		И ЗначениеЗаполнено(Результат.КодАлкогольнойПродукции) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Операция",          ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ЗапросАлкогольнойПродукции"));
		ПараметрыФормы.Вставить("ИмяПараметра",      "КОД");
		ПараметрыФормы.Вставить("ЗначениеПараметра", Результат.КодАлкогольнойПродукции);
		
		ОткрытьФорму(
			"ОбщаяФорма.ФормированиеИсходящегоЗапросаЕГАИС",
			ПараметрыФормы,
			ЭтотОбъект,,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
	ИначеЕсли ЗначениеЗаполнено(Результат.АлкогольнаяПродукция) Тогда
		
		Элементы.Список.ТекущаяСтрока = Результат.АлкогольнаяПродукция;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон(
				НСтр("ru = 'По коду акцизной марки %1 не удалось определить код алкогольной продукции'"),
				Результат.КодАкцизнойМарки));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолученDataMatrix(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Справки2.Количество() = 1 Тогда
		
		Элементы.Список.ТекущаяСтрока = Результат.Справки2[0].АлкогольнаяПродукция;
		
	Иначе
		
		СписокСсылок = Новый СписокЗначений;
		Для Каждого ДанныеСправки2 Из Результат.Справки2 Цикл
			СписокСсылок.Добавить(ДанныеСправки2.АлкогольнаяПродукция);
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Ссылка");
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Ссылка",
			СписокСсылок,
			ВидСравненияКомпоновкиДанных.ВСписке,,
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоШтрихкоду(Штрихкод)
	
	Возврат ШтрихкодированиеНоменклатурыЕГАИСПереопределяемый.НайтиПоШтрихкоду(Штрихкод);
	
КонецФункции

#Область Оборудование

&НаКлиенте
Процедура ПодключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При отключении оборудования произошла ошибка: ""%ОписаниеОшибки%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
